ci: replace mermaid with plantuml
